# 3. Pandas
판다스의 시리즈

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

data_l = [1, 2, 3, 4, 5]
e_obj = Series([data_l])

e_obj

0    [1, 2, 3, 4, 5]
dtype: object

In [2]:
idx_l = ['a', 'b', 'c', 'd', 'e']
e_obj = Series(data = data_l, index = idx_l)

e_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
e_obj = Series(data = [data_l, data_l, data_l, data_l, 1], index = idx_l)

e_obj

a    [1, 2, 3, 4, 5]
b    [1, 2, 3, 4, 5]
c    [1, 2, 3, 4, 5]
d    [1, 2, 3, 4, 5]
e                  1
dtype: object

In [5]:
e_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
e_obj.values

array([list([1, 2, 3, 4, 5]), list([1, 2, 3, 4, 5]),
       list([1, 2, 3, 4, 5]), list([1, 2, 3, 4, 5]), 1], dtype=object)

In [7]:
type(e_obj.values)

numpy.ndarray

In [9]:
e_obj.name = 'data_s'
e_obj.index.name = 'id'

e_obj

id
a    [1, 2, 3, 4, 5]
b    [1, 2, 3, 4, 5]
c    [1, 2, 3, 4, 5]
d    [1, 2, 3, 4, 5]
e                  1
Name: data_s, dtype: object

In [10]:
dic = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5, 'g':6}
e_obj = Series(dic, dtype = np.float32, name = 'data_s')
e_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
g    6.0
Name: data_s, dtype: float32

In [11]:
idx_d = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
e_obj = Series(dic, index = idx_d)

e_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    6.0
dtype: float64

In [12]:
data = {
    '이름' : ['홍길동', '도우너', '희동이', '고길동'],
    '계좌번호' : ['1234', '4321', '4567', '7890'],
    '금액' : [10000, 100, 500, 50000],
    '은행' : ['국민', '하나', '우리', '신한']
}
df = DataFrame(data, index = ['1번고객', '2번고객', '3번고객', '4번고객']) #2차원

df

       이름  계좌번호     금액  은행
1번고객  홍길동  1234  10000  국민
2번고객  도우너  4321    100  하나
3번고객  희동이  4567    500  우리
4번고객  고길동  7890  50000  신한

## csv파일 저장

In [15]:
df.to_csv('data_1.csv', encoding = 'utf-8-sig') # 인덱스 포함하여 저장

In [16]:
df.to_csv('data_2.csv', encoding = 'utf-8-sig', index = False)

## 텍스트(.txt) 저장

In [17]:
df.to_csv('data_3.txt', sep = '\t', index = False)

## Excel파일 저장

In [18]:
df.to_excel('data_4.xlsx')

## 열기

In [19]:
df = pd.read_csv('data_1.csv')
df

  Unnamed: 0   이름  계좌번호     금액  은행
0       1번고객  홍길동  1234  10000  국민
1       2번고객  도우너  4321    100  하나
2       3번고객  희동이  4567    500  우리
3       4번고객  고길동  7890  50000  신한

In [21]:
df = pd.read_csv('data_2.csv')
df

    이름  계좌번호     금액  은행
0  홍길동  1234  10000  국민
1  도우너  4321    100  하나
2  희동이  4567    500  우리
3  고길동  7890  50000  신한

In [22]:
df = pd.read_csv('data_2.csv', skiprows = 1)
df

   홍길동  1234  10000  국민
0  도우너  4321    100  하나
1  희동이  4567    500  우리
2  고길동  7890  50000  신한

In [26]:
df = pd.read_csv('data_2.csv', skiprows = [0, 1])
df

   도우너  4321    100  하나
0  희동이  4567    500  우리
1  고길동  7890  50000  신한

In [23]:
df = pd.read_csv('data_2.csv', skiprows = [0, 1], header = None)
df

     0     1      2   3
0  도우너  4321    100  하나
1  희동이  4567    500  우리
2  고길동  7890  50000  신한

In [25]:
df = pd.read_csv('data_2.csv', skiprows = [1, 3], nrows = 2)
df

    이름  계좌번호     금액  은행
0  도우너  4321    100  하나
1  고길동  7890  50000  신한

In [27]:
# df = pd.read_csv('data_3.txt', sep = '\t', index_col = '이름')
df = pd.read_csv('data_3.txt', sep = '\t')
df.set_index('이름', inplace = True)

df

     계좌번호     금액  은행
이름
홍길동  1234  10000  국민
도우너  4321    100  하나
희동이  4567    500  우리
고길동  7890  50000  신한

In [28]:
df = pd.read_excel('data_4.xlsx', index_col = '이름')
df

    Unnamed: 0  계좌번호     금액  은행
이름
홍길동       1번고객  1234  10000  국민
도우너       2번고객  4321    100  하나
희동이       3번고객  4567    500  우리
고길동       4번고객  7890  50000  신한

In [29]:
data = {
    '이름' : ['홍길동', '도우너', '희동이', '고길동'],
    '계좌번호' : ['1234', '4321', '4567', '7890'],
    '금액' : [10000, 100, 500, 50000],
    '은행' : ['국민', '하나', '우리', '신한']
}
ex_df = DataFrame(data, columns = ['이름', '은행', '적금유무'])

ex_df

    이름  은행 적금유무
0  홍길동  국민  NaN
1  도우너  하나  NaN
2  희동이  우리  NaN
3  고길동  신한  NaN

In [30]:
ex_df.head(3)

    이름  은행 적금유무
0  홍길동  국민  NaN
1  도우너  하나  NaN
2  희동이  우리  NaN

In [31]:
ex_df.head(3).T

        0    1    2
이름    홍길동  도우너  희동이
은행     국민   하나   우리
적금유무  NaN  NaN  NaN

In [33]:
df = pd.read_excel('data_4.xlsx')
df

  Unnamed: 0   이름  계좌번호     금액  은행
0       1번고객  홍길동  1234  10000  국민
1       2번고객  도우너  4321    100  하나
2       3번고객  희동이  4567    500  우리
3       4번고객  고길동  7890  50000  신한

In [34]:
data = {
    '이름' : ['홍길동', '도우너', '희동이', '고길동'],
    '계좌번호' : ['1234', '4321', '4567', '7890'],
    '금액' : [10000, 100, 500, 50000],
    '은행' : ['국민', '하나', '우리', '신한']
}

df_t = DataFrame(data)

df_t

    이름  계좌번호     금액  은행
0  홍길동  1234  10000  국민
1  도우너  4321    100  하나
2  희동이  4567    500  우리
3  고길동  7890  50000  신한